[
  {
    "title": "Harry Potter and the Chamber of Secrets",
    "description": "Cars fly, trees fight back, and a mysterious house-elf comes to warn Harry Potter at the start of his second year at Hogwarts. Adventure and danger await when bloody writing on a wall announces: The Chamber Of Secrets Has Been Opened. To save Hogwarts will require all of Harry, Ron and Hermione’s magical abilities and courage.",
    "image": "https://ntvb.tmsimg.com/assets/p30737_v_h8_az.jpg?w=1280&h=720",
    "director": "Chris Columbus",
    "year": 2002
  },
  {
    "title": "Fast X",
    "description": "Over many missions and against impossible odds, Dom Toretto and his family have outsmarted, out-nerved and outdriven every foe in their path. Now, they confront the most lethal opponent they've ever faced: A terrifying threat emerging from the shadows of the past who's fueled by blood revenge, and who is determined to shatter this family and destroy everything—and everyone—that Dom loves, forever.,",
    "image": "https://upload.wikimedia.org/wikipedia/en/f/f2/Fast_X_poster.jpg",
    "director": "Louis Leterrier",
    "year": 2023
  },
  {
    "title": "How the Grinch Stole Christmas",
    "description": "The Grinch decides to rob Whoville of Christmas - but a dash of kindness from little Cindy Lou Who and her family may be enough to melt his heart...",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSibsal1v-x0Dtu36uISQy33-Z-ZL6yBVtWXKJ1X0Fhca_cn0DP",
    "director": "Ron Howard",
    "year": 2000
  },
  {
    "title": "Avatar",
    "description": "In the 22nd century, a paraplegic Marine is dispatched to the moon Pandora on a unique mission, but becomes torn between following orders and protecting an alien civilization.,",
    "image": "https://m.media-amazon.com/images/I/41kTVLeW1CL.jpg",
    "director": "James Cameron",
    "year": 2009
  },
  {
    "title": "The Hunger Games: The Ballad of Songbirds & Snakes,",
    "description": "64 years before he becomes the tyrannical president of Panem, Coriolanus Snow sees a chance for a change in fortunes when he mentors Lucy Gray Baird, the female tribute from District 12.,",
    "image": "https://upload.wikimedia.org/wikipedia/en/9/96/The_Hunger_Games_-_The_Ballad_of_Songbirds_%26_Snakes_official_poster.jpg",
    "director": "Francis Lawrence",
    "year": 2023
  },
  {
    "title": "The Shawshank Redemption",
    "description": "Framed in the 1940s for the double murder of his wife and her lover, upstanding banker Andy Dufresne begins a new life at the Shawshank prison, where he puts his accounting skills to work for an amoral warden. During his long stretch in prison, Dufresne comes to be admired by the other inmates -- including an older prisoner named Red -- for his integrity and unquenchable sense of hope.",
    "image": "https://m.media-amazon.com/images/I/71715eBi1sL.jpg",
    "director": "Frank Darabont",
    "year": 1994
  },
  {
    "title": "Oppenheimer",
    "description": "The story of J. Robert Oppenheimer's role in the development of the atomic bomb during World War II.,",
    "image": "https://ih1.redbubble.net/image.1955070864.0932/flat,750x,075,f-pad,750x1000,f8f8f8.jpg",
    "director": "Christopher Nolan",
    "year": 2023
  },
  {
    "title": "Inception",
    "description": "Cobb, a skilled thief who commits corporate espionage by infiltrating the subconscious of his targets is offered a chance to regain his old life as payment for a task considered to be impossible: \\inception\\, the implantation of another person's idea into a target's subconscious.",
    "image": "https://ih1.redbubble.net/image.1955070864.0932/flat,750x,075,f-pad,750x1000,f8f8f8.jpg",
    "director": "Christopher Nolan",
    "year": 2010
  },
  {
    "title": "Toy Story",
    "description": "Led by Woody, Andy's toys live happily in his room until Andy's birthday brings Buzz Lightyear onto the scene. Afraid of losing his place in Andy's heart, Woody plots against Buzz. But when circumstances separate Buzz and Woody from their owner, the duo eventually learns to put aside their differences.",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRj2bfCbpzIaikS1zFEpXU265CJvUtn4bz2sj1h_lANT-sV1vER0woikvBnoQ&s",
    "director": "John Lasseter",
    "year": 1995
  },
  {
    "title": "Coraline",
    "description": "A young girl discovers an idealized parallel universe behind a secret door in her new home, unaware that it contains a sinister secret.",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRj2bfCbpzIaikS1zFEpXU265CJvUtn4bz2sj1h_lANT-sV1vER0woikvBnoQ&s",
    "director": "Henry Selick",
    "year": 2009
  },
  {
    "title": "The Nightmare Before Christmas,",
    "description": "Tired of scaring humans every October 31 with the same old bag of tricks, Jack Skellington, the spindly king of Halloween Town, kidnaps Santa Claus and plans to deliver shrunken heads and other ghoulish gifts to children on Christmas morning. But as Christmas approaches, Jack's rag-doll girlfriend, Sally, tries to foil his misguided plans.,",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRj2bfCbpzIaikS1zFEpXU265CJvUtn4bz2sj1h_lANT-sV1vER0woikvBnoQ&s",
    "director": "Henry Selick",
    "year": 1993
  },
  {
    "title": "A Beautiful Mind",
    "description": "John Nash is a brilliant but asocial mathematician fighting schizophrenia. After he accepts secret work in cryptography, his life takes a turn for the nightmarish.",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRj2bfCbpzIaikS1zFEpXU265CJvUtn4bz2sj1h_lANT-sV1vER0woikvBnoQ&s",
    "director": "Ron Howard",
    "year": 2001
  },
  {
    "title": "The Lord of the Rings: The Fellowship of the Ring",
    "description": "Young hobbit Frodo Baggins, after inheriting a mysterious ring from his uncle Bilbo, must leave his home in order to keep it from falling into the hands of its evil creator. Along the way, a fellowship is formed to protect the ringbearer and make sure that the ring arrives at its final destination: Mt. Doom, the only place where it can be destroyed.",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRj2bfCbpzIaikS1zFEpXU265CJvUtn4bz2sj1h_lANT-sV1vER0woikvBnoQ&s",
    "director": "Peter Jackson",
    "year": 2001
  },
  {
    "title": "Shrek",
    "description": "It ain't easy bein' green -- especially if you're a likable (albeit smelly) ogre named Shrek. On a mission to retrieve a gorgeous princess from the clutches of a fire-breathing dragon, Shrek teams up with an unlikely compatriot -- a wisecracking donkey.",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRj2bfCbpzIaikS1zFEpXU265CJvUtn4bz2sj1h_lANT-sV1vER0woikvBnoQ&s",
    "director": "Andrew Adamson, Vicky Jenson",
    "year": 2001
  },
  {
    "title": "Spider-Man: No Way Home",
    "description": "Peter Parker is unmasked and no longer able to separate his normal life from the high-stakes of being a super-hero. When he asks for help from Doctor Strange the stakes become even more dangerous, forcing him to discover what it truly means to be Spider-Man.",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRj2bfCbpzIaikS1zFEpXU265CJvUtn4bz2sj1h_lANT-sV1vER0woikvBnoQ&s",
    "director": "Jon Watts",
    "year": 2021
  },
  {
    "title": "Black Panther: Wakanda Forever",
    "description": "Queen Ramonda, Shuri, M’Baku, Okoye and the Dora Milaje fight to protect their nation from intervening world powers in the wake of King T’Challa’s death.  As the Wakandans strive to embrace their next chapter, the heroes must band together with the help of War Dog Nakia and Everett Ross and forge a new path for the kingdom of Wakanda.",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRj2bfCbpzIaikS1zFEpXU265CJvUtn4bz2sj1h_lANT-sV1vER0woikvBnoQ&s",
    "director": "Ryan Coogler",
    "year": 2022
  },
  {
    "title": "Space Wars: Quest for the Deepstar",
    "description": "A father and daughter team of space scavengers race against a band of evil mercenaries to reach a legendary lost freighter called the Deepstar. Along their trek through the universe, they encounter monsters, aliens, robots, and something even worse.",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRj2bfCbpzIaikS1zFEpXU265CJvUtn4bz2sj1h_lANT-sV1vER0woikvBnoQ&s",
    "director": "Garo Setian",
    "year": 2023
  },
  {
    "title": "Casablanca",
    "description": "In Casablanca, Morocco in December 1941, a cynical American expatriate meets a former lover, with unforeseen complications.",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRj2bfCbpzIaikS1zFEpXU265CJvUtn4bz2sj1h_lANT-sV1vER0woikvBnoQ&s",
    "director": "Michael Curtiz",
    "year": 1943
  },
  {
    "title": "National Lampoon's Christmas Vacation",
    "description": "It's Christmastime, and the Griswolds are preparing for a family seasonal celebration. But things never run smoothly for Clark, his wife Ellen, and their two kids. Clark's continual bad luck is worsened by his obnoxious family guests, but he manages to keep going, knowing that his Christmas bonus is due soon.",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRj2bfCbpzIaikS1zFEpXU265CJvUtn4bz2sj1h_lANT-sV1vER0woikvBnoQ&s",
    "director": "Jeremiah S. Chechik",
    "year": 1989
  },
  {
    "title": "Parasite,",
    "description": "All unemployed, Ki-taek's family takes peculiar interest in the wealthy and glamorous Parks for their livelihood until they get entangled in an unexpected incident.,",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRj2bfCbpzIaikS1zFEpXU265CJvUtn4bz2sj1h_lANT-sV1vER0woikvBnoQ&s",
    "director": "Bong Joon-ho",
    "year": 2019
  },
  {
    "title": "Wonka",
    "description": "Willy Wonka – chock-full of ideas and determined to change the world one delectable bite at a time – is proof that the best things in life begin with a dream, and if you’re lucky enough to meet Willy Wonka, anything is possible.",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRj2bfCbpzIaikS1zFEpXU265CJvUtn4bz2sj1h_lANT-sV1vER0woikvBnoQ&s",
    "director": "Paul King",
    "year": 2023
  },
  {
    "title": "The Godfather,",
    "description": "Spanning the years 1945 to 1955, a chronicle of the fictional Italian-American Corleone crime family. When organized crime family patriarch, Vito Corleone barely survives an attempt on his life, his youngest son, Michael steps in to take care of the would-be killers, launching a campaign of bloody revenge.,",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRj2bfCbpzIaikS1zFEpXU265CJvUtn4bz2sj1h_lANT-sV1vER0woikvBnoQ&s",
    "director": "Francis Ford Coppola",
    "year": 1972
  },
  {
    "title": "Dilwale Dulhania Le Jayenge",
    "description": "Raj is a rich, carefree, happy-go-lucky second generation NRI. Simran is the daughter of Chaudhary Baldev Singh, who in spite of being an NRI is very strict about adherence to Indian values. Simran has left for India to be married to her childhood fiancé. Raj leaves for India with a mission at his hands, to claim his lady love under the noses of her whole family. Thus begins a saga.",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRj2bfCbpzIaikS1zFEpXU265CJvUtn4bz2sj1h_lANT-sV1vER0woikvBnoQ&s",
    "director": "Adiya Chopra",
    "year": 1995
  },
  {
    "title": "Spirited Away",
    "description": "A young girl, Chihiro, becomes trapped in a strange new world of spirits. When her parents undergo a mysterious transformation, she must call upon the courage she never knew she had to free her family.",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRj2bfCbpzIaikS1zFEpXU265CJvUtn4bz2sj1h_lANT-sV1vER0woikvBnoQ&s",
    "director": "Hayao Miyazaki",
    "year": 2001
  },
  {
    "title": "Pulp Fiction",
    "description": "A burger-loving hit man, his philosophical partner, a drug-addled gangster's moll and a washed-up boxer converge in this sprawling, comedic crime caper. Their adventures unfurl in three stories that ingeniously trip back and forth in time.",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRj2bfCbpzIaikS1zFEpXU265CJvUtn4bz2sj1h_lANT-sV1vER0woikvBnoQ&s",
    "director": "Quentin Tarantino",
    "year": 1994
  },
  {
    "title": "Fight Club,",
    "description": "A ticking-time-bomb insomniac and a slippery soap salesman channel primal male aggression into a shocking new form of therapy. Their concept catches on, with underground \\fight clubs\\ forming in every town, until an eccentric gets in the way and ignites an out-of-control spiral toward oblivion.,",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRj2bfCbpzIaikS1zFEpXU265CJvUtn4bz2sj1h_lANT-sV1vER0woikvBnoQ&s",
    "director": "David Fincher",
    "year": 1999
  },
  {
    "title": "Forrest Gump",
    "description": "A man with a low IQ has accomplished great things in his life and been present during significant historic events—in each case, far exceeding what anyone imagined he could do. But despite all he has achieved, his one true love eludes him.",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRj2bfCbpzIaikS1zFEpXU265CJvUtn4bz2sj1h_lANT-sV1vER0woikvBnoQ&s",
    "director": "Robert Zemeckis",
    "year": 1994
  },
  {
    "title": "GoodFellas",
    "description": "The true story of Henry Hill, a half-Irish, half-Sicilian Brooklyn kid who is adopted by neighbourhood gangsters at an early age and climbs the ranks of a Mafia family under the guidance of Jimmy Conway.",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRj2bfCbpzIaikS1zFEpXU265CJvUtn4bz2sj1h_lANT-sV1vER0woikvBnoQ&s",
    "director": "Martin Scorsese",
    "year": 1990
  },
  {
    "title": "Meg 2: The Trench",
    "description": "An exploratory dive into the deepest depths of the ocean of a daring research team spirals into chaos when a malevolent mining operation threatens their mission and forces them into a high-stakes battle for survival.",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRj2bfCbpzIaikS1zFEpXU265CJvUtn4bz2sj1h_lANT-sV1vER0woikvBnoQ&s",
    "director": "Ben Wheatley",
    "year": 2023
  }
]